In [1]:
import numpy as np
import pandas as pd

### merging 2 dataframes

In [3]:
data1 = {
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, np.nan, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}
df1 = pd.DataFrame(data1)

# Second DataFrame
data2 = {
    'ID': [3, 4, 5, 6],
    'Department': ['HR', 'IT', 'Finance', 'Marketing'],
    'Salary': [60000, 75000, 80000, np.nan],
    'City': ['Chicago', 'Houston', 'Boston', 'Miami']
}
df2 = pd.DataFrame(data2)

print("DataFrame 1:")
print(df1)
print("\nDataFrame 2:")
print(df2)

DataFrame 1:
   ID     Name   Age         City
0   1    Alice  25.0     New York
1   2      Bob  30.0  Los Angeles
2   3  Charlie   NaN      Chicago
3   4    David  40.0      Houston

DataFrame 2:
   ID Department   Salary     City
0   3         HR  60000.0  Chicago
1   4         IT  75000.0  Houston
2   5    Finance  80000.0   Boston
3   6  Marketing      NaN    Miami

In [28]:
lst = {'Salary':60000.0};

df2.fillna(value=lst,inplace=True)

lst2 = {'Age':26}

df1.fillna(value=lst2,inplace=True);

In [33]:
print(df1)
print(df2)

   ID     Name   Age         City
0   1    Alice  25.0     New York
1   2      Bob  30.0  Los Angeles
2   3  Charlie  26.0      Chicago
3   4    David  40.0      Houston
   ID Department   Salary     City
0   3         HR  60000.0  Chicago
1   4         IT  75000.0  Houston
2   5    Finance  80000.0   Boston
3   6  Marketing  60000.0    Miami

In [38]:
print(pd.merge(df1,df2,on = 'ID',how = 'inner'));

   ID     Name   Age   City_x Department   Salary   City_y
0   3  Charlie  26.0  Chicago         HR  60000.0  Chicago
1   4    David  40.0  Houston         IT  75000.0  Houston

In [40]:
print(pd.merge(df1,df2,on = 'ID',how = 'outer'));

   ID     Name   Age       City_x Department   Salary   City_y
0   1    Alice  25.0     New York        NaN      NaN      NaN
1   2      Bob  30.0  Los Angeles        NaN      NaN      NaN
2   3  Charlie  26.0      Chicago         HR  60000.0  Chicago
3   4    David  40.0      Houston         IT  75000.0  Houston
4   5      NaN   NaN          NaN    Finance  80000.0   Boston
5   6      NaN   NaN          NaN  Marketing  60000.0    Miami

In [42]:
print(pd.merge(df1,df2,on = 'ID',how = 'left'));

   ID     Name   Age       City_x Department   Salary   City_y
0   1    Alice  25.0     New York        NaN      NaN      NaN
1   2      Bob  30.0  Los Angeles        NaN      NaN      NaN
2   3  Charlie  26.0      Chicago         HR  60000.0  Chicago
3   4    David  40.0      Houston         IT  75000.0  Houston

In [43]:
print(pd.merge(df1,df2,on = 'ID',how = 'right'));

   ID     Name   Age   City_x Department   Salary   City_y
0   3  Charlie  26.0  Chicago         HR  60000.0  Chicago
1   4    David  40.0  Houston         IT  75000.0  Houston
2   5      NaN   NaN      NaN    Finance  80000.0   Boston
3   6      NaN   NaN      NaN  Marketing  60000.0    Miami

In [45]:
print(pd.concat([df1,df2]));

   ID     Name   Age         City Department   Salary
0   1    Alice  25.0     New York        NaN      NaN
1   2      Bob  30.0  Los Angeles        NaN      NaN
2   3  Charlie  26.0      Chicago        NaN      NaN
3   4    David  40.0      Houston        NaN      NaN
0   3      NaN   NaN      Chicago         HR  60000.0
1   4      NaN   NaN      Houston         IT  75000.0
2   5      NaN   NaN       Boston    Finance  80000.0
3   6      NaN   NaN        Miami  Marketing  60000.0

In [47]:
print(pd.concat([df1,df2],axis=1));

   ID     Name   Age         City  ID Department   Salary     City
0   1    Alice  25.0     New York   3         HR  60000.0  Chicago
1   2      Bob  30.0  Los Angeles   4         IT  75000.0  Houston
2   3  Charlie  26.0      Chicago   5    Finance  80000.0   Boston
3   4    David  40.0      Houston   6  Marketing  60000.0    Miami

## joining 2 data frames

In [53]:


df3 = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]
}, index=[1, 2, 3])

df4 = pd.DataFrame({
    'Salary': [50000, 60000, 70000]
}, index=[1, 2, 4])  # Note: index 4 won't match

print(df3.join(df4, how='outer'))

      Name   Age   Salary
1    Alice  25.0  50000.0
2      Bob  30.0  60000.0
3  Charlie  35.0      NaN
4      NaN   NaN  70000.0